'''
Написать программу, которая будет делить введенные пользователем два вещественных числа и выводить результат на экран, сообщая об ошибке в случае деления на ноль.
'''
'''a = float(input())
b = float(input())

if b != 0:
    print(a / b)
else:
    print("Ошибка. Деление на ноль запрещено")
'''

'''
Рассчитать стоимость покупки с учетом скидки в 35%, которая предоставляется покупателю, если сумма покупки превышает 20 у.е. Сумму покупки ввести с клавиатуры, а результаты округлить до сотых (копейки, центы и т.д.). Вывести на экран итоговую стоимость и размер предоставленной скидки.
'''
'''purchase_amount = float(input("Введите стоимость покупки: "))
a = 20  # порог для предоставления скидки
b = 0.35  # размер скидки

if purchase_amount > a:
    c = purchase_amount * b  # полученная скидка
    d = purchase_amount - c  # стоимость покупки с учётом скидки
else:
    c = 0  # скидка равна нулю
    d = purchase_amount  # стоимость не изменится

с = round(c, 2)
d = round(d, 2)

print("Итоговая стоимость: ", d)
print("Размер скидки: ", c)
'''

'''
Напишите скрипт, который по введенному пользователем числу от 1 до 12, будет выводить на экран сообщение в виде названия месяца и времени года. Если пользователь введет недопустимое число, программа должна выдавать сообщение об ошибке.
'''
'''months = [
    ('январь', 'зима'),
    ('февраль', 'зима'),
    ('март', 'весна'),
    ('апрель', 'весна'),
    ('май', 'весна'),
    ('июнь', 'лето'),
    ('июль', 'лето'),
    ('август', 'лето'),
    ('сентябрь', 'осень'),
    ('октябрь', 'осень'),
    ('ноябрь', 'осень'),
    ('декабрь', 'зима')
]

month_number = int(input("Введите число от 1 до 12: "))

if 1 <= month_number <= 12:
    month_name, season = months[month_number - 1]
    print("Месяц:", month_name)
    print("Время года:", season)
else:
    print("Ошибка. Введите число от 1 до 12")
'''

'''
Написать скрипт, который решает квадратное уравнение
'''
a = float(input())
b = float(input())
c = float(input())
if a != 0:
    if (b ** 2) - (4 * a * c) == 0:
        print(-(c ** 0.5) / (a ** 0.5))
    elif (b ** 2) - (4 * a * c) > 0:
            d = ((b ** 2) - (4 * a * c)) ** 0.5
            print("Дискриминант: ", d)
            x1 = (-b - d) / (2 * a)
            x2 = (-b + d) / (2 * a)
            print("Первый корень:",x1,"Второй корень:", x2)
    else: 
         print('Нет корней')
elif b == 0:
    print('-inf:+inf')
else:
     print(-c / b) 