'''
1. В России применяются регистрационные знаки нескольких видов. Общего в них то, что они состоят из цифр и букв. Причём используются только 12 букв кириллицы, имеющие графические аналоги в латинском алфавите — А, В, Е, К, М, Н, О, Р, С, Т, У и Х.
У частных легковых автомобилях номера — это буква, три цифры, две буквы, затем две или три цифры с кодом региона. У такси — две буквы, три цифры, затем две или три цифры с кодом региона. Есть также и другие виды, но в этой задаче они не понадобятся.

Вам потребуется определить, является ли последовательность букв корректным номером указанных двух типов, и если является, то каким.

На вход даются строки, которые претендуют на то, чтобы быть номером. Определите тип номера. Буквы в номерах — заглавные русские. Маленькие и английские для простоты можно игнорировать.
'''
'''import re

a = str(input("Введите регистрационный номер: "))
if re.fullmatch(r'[АВЕКМНОРСТУХ]\d{3}[АВЕКМНОРСТУХ]{2}\d{2,3}$', a):
    print("Частный автомобиль")
elif re.fullmatch(r'[АВЕКМНОРСТУХ]{2}\d{3}\d{2,3}$', a):
    print("Такси")
else:
    print("Неверный номер. Попробуйте снова")
'''

'''
3. Вовочка подготовил одно очень важное письмо, но везде указал неправильное время. Поэтому нужно заменить все вхождения времени на строку (TBD). 
Время — это строка вида HH:MM:SS или HH:MM, в которой HH — число от 00 до 23, а MM и SS — число от 00 до 59. 
(ВВОД: Уважаемые! Если вы к 09:00 не вернёте чемодан, то уже в 09:00:01 я за себя не отвечаю. 
ВЫВОД: Уважаемые! Если вы к (TBD) не вернёте чемодан, то уже в (TBD) я за себя не отвечаю. )
'''

'''import re
def replace(text):
    time = r"\b([01]?[0-9]|2[0-3]):[0-5][0-9](?::[0-5]?[0-9])?\b"
    return re.sub(time, '(TBD)', text)


input_text = "Уважаемые! Если вы к 09:00 не вернёте чемодан, то уже в 09:00:01 я за себя не отвечаю."
result = replace(input_text)
print(result)
'''

'''
Владимир устроился на работу в одно очень важное место. И в первом же документе он ничего не понял, там были сплошные ФГУП НИЦ ГИДГЕО, ФГОУ ЧШУ АПК и т.п.
Тогда он решил собрать все аббревиатуры, чтобы потом найти их расшифровки на http://sokr.ru/.
Помогите ему. Будем считать аббревиатурой слова только лишь из заглавных букв (как минимум из двух). Если несколько таких слов разделены пробелами, то они считаются одной аббревиатурой.
'''

import re


def abbreviation(text):
    abbreviation_pattern = r'\b[А-Я]{2,}(?:\s[А-Я]{2,})*\b'
    return re.findall(abbreviation_pattern, text)


text = "Если считать эти утверждения истинными, то уже поступившие в Россию из КНР $6 млрд находятся сейчас на счетах «Роснефти». Остается загадкой, кто в этом случае заплатил более $9 млрд за БФГ, которая выиграла аукцион по акциям ЮНГ 19 декабря и затем была продана «Роснефти». До 11 января, когда БФГ вроде бы перечислила на счета службы судебных приставов в МДМ-банке оплату за акции ЮНГ, китайских денег в России еще не было, поскольку не был подписан контракт на поставку нефти в адрес госкомпаний КНР."
abbreviatios = abbreviation(text)
print(abbreviatios)
