'''
1. Дана строка, содержащая русскоязычный текст. Найти количество слов, начинающихся с буквы "е".
'''
'''s = 'это лучшие произведения классической и современной отечественной и зарубежной детской литературы.Книги включают полные классические тексты произведений.Великолепные красочные иллюстрации выполнены лучшими художниками.Важное преимущество серии'
print(s.count(' Е') + s.count(' е'))
'''

'''
2. В строке заменить все двоеточия (:) знаком процента (%). Подсчитать количество замен.
'''
'''s = 'Катя не дочитала книгу: мама попросила помочь по дому. Витя прекрасно говорит по-английски: он каждый день занимается с репетитором. Саша убрался в своей комнате: книги стояли на полках, вещи были сложены в шкаф. На улице шел сильный дождь: крупные капли стучали в окна.'
total = 0
for i in range(len(s)):
    if s[i] == ":":
        s = s.replace(':', '%', 1)
        total += 1
print(total)
'''
'''
3. В строке удалить символ точку (.) и подсчитать количество удаленных символов.
'''
'''s = 'Катя не дочитала книгу: мама попросила помочь по дому. Витя прекрасно говорит по-английски: он каждый день занимается с репетитором. Саша убрался в своей комнате: книги стояли на полках, вещи были сложены в шкаф. На улице шел сильный дождь: крупные капли стучали в окна.'
total = 0 
# print(len(s))
for i in range(len(s)):
    # print(i)
    if s[i] == ".":
        s = s.replace('.', ' ', 1)
        total += 1
print(total)
'''

'''
4. Дан одномерный массив из 10 целых чисел. Вывести пары отрицательных чисел, стоящих рядом.
'''
from random import randint
a = [randint(10,80) for ]