'''
1. Дано вещественное число – цена 1 кг конфет. Вывести стоимость 1, 2, ... 10 кг конфет.  
'''

'''n = float(input("Введите стоимость конфет:"))
for i in range(1, 11):
    print(n * i)
'''
    

'''
Дана непустая последовательность целых чисел, оканчивающаяся нулем. 
Найти: а) сумму всех чисел последовательности; б) количество всех чисел последовательности.  
Решить задачу используя циклическую конструкцию while.
'''

'''a = []
while a.count(0) != 1:
    a.append(int(input()))
    c = sum(a)              
    n = len(a)
    print("Сумма чисел:",c, "Количество всех чисел:", n-1)
    '''


'''
3. Найдите сумму всех элементов списка [1, '2', 3, 4, '5'], предварительно приводя строки к целым числам.
'''
'''a = [1, '2', 3, 4, '5']
for i in range(len(a)):
    a[i] = int(a[i])
b = sum(a)
print("Сумма всех элементов:", b)
'''

'''
Вывести альфавит
'''
total = ''
for i in range(1040, 1072):
    n = chr(i)
    total += chr(124) + n + n.lower() + chr(124)
print(total[:20], end = "")
