'''
Вычислить и вывести на экран длину окружности и площадь круга одного и того же заданного радиуса R, который необходимо ввести с клавиатуры в сантиметрах. Результаты должны округляться до сотых.
'''
print("Задача 1:")
import math
R = float(input("Введите радиус окружности в сантиметрах: R="))
l = round(2*math.pi*R,2)
S = round(math.pi*math.pow(R,2),2)
print("Длина окружности в сантиметрах: ",l)
print("Площадь круга в квадратных сантиметрах: ", S)

'''
Даны две переменные x = 10 и y = 55. Поменяйте их значения местами. Выведите значения переменных на экран до и после замены.
'''

print("Задача 2:")
x = 10
y = 35
print("Значения переменных до замены: ", x,y)
x,y = y,x
print("Значения переменных после замены:", x,y)

'''
Вычислить и вывести на экран период колебания маятника длиной L с точностью до сотых. Для рассчетов использовать формулу T = 2π√(L/g), где g – ускорение свободного падения (9.81 м/c2). Значение длины маятника в метрах необходимо ввести с клавиатуры.
'''
 
print("Задача 3:")
import math
L= float(input("Введите значение длины маятника в метрах: L="))
g= 9.81
T = round(2*math.pi* math.sqrt(L/g), 2)
print("Значение периода колебаний маятника в секундах: ", T)
